{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<s>": 1,
      "</s>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "/": 5,
      "<": 6,
      ">": 7,
      "A": 8,
      "B": 9,
      "C": 10,
      "D": 11,
      "E": 12,
      "F": 13,
      "G": 14,
      "H": 15,
      "I": 16,
      "J": 17,
      "K": 18,
      "L": 19,
      "M": 20,
      "N": 21,
      "O": 22,
      "P": 23,
      "Q": 24,
      "R": 25,
      "S": 26,
      "T": 27,
      "V": 28,
      "W": 29,
      "X": 30,
      "Y": 31,
      "Z": 32,
      "a": 33,
      "b": 34,
      "c": 35,
      "d": 36,
      "e": 37,
      "f": 38,
      "g": 39,
      "h": 40,
      "i": 41,
      "j": 42,
      "k": 43,
      "l": 44,
      "m": 45,
      "n": 46,
      "o": 47,
      "p": 48,
      "r": 49,
      "s": 50,
      "t": 51,
      "u": 52,
      "v": 53,
      "w": 54,
      "x": 55,
      "y": 56,
      "z": 57,
      "</": 58,
      "er": 59,
      "ie": 60,
      "in": 61,
      "ar": 62,
      "on": 63,
      "an": 64,
      "ll": 65,
      "as": 66,
      "en": 67,
      "Ch": 68,
      "ey": 69,
      "us": 70,
      "Ma": 71,
      "el": 72,
      "is": 73,
      "ter": 74,
      "Br": 75,
      "es": 76,
      "lo": 77,
      "dy": 78,
      "al": 79,
      "ck": 80,
      "op": 81,
      "et": 82,
      "ley": 83,
      "or": 84,
      "Co": 85,
      "Ro": 86,
      "ce": 87,
      "un": 88,
      "co": 89,
      "Mi": 90,
      "Re": 91,
      "Sa": 92,
      "by": 93,
      "ch": 94,
      "per": 95,
      "inn": 96,
      "lly": 97,
      "ash": 98,
      "Ar": 99
    },
    "merges": [
      [
        "<",
        "/"
      ],
      [
        "e",
        "r"
      ],
      [
        "i",
        "e"
      ],
      [
        "i",
        "n"
      ],
      [
        "a",
        "r"
      ],
      [
        "o",
        "n"
      ],
      [
        "a",
        "n"
      ],
      [
        "l",
        "l"
      ],
      [
        "a",
        "s"
      ],
      [
        "e",
        "n"
      ],
      [
        "C",
        "h"
      ],
      [
        "e",
        "y"
      ],
      [
        "u",
        "s"
      ],
      [
        "M",
        "a"
      ],
      [
        "e",
        "l"
      ],
      [
        "i",
        "s"
      ],
      [
        "t",
        "er"
      ],
      [
        "B",
        "r"
      ],
      [
        "e",
        "s"
      ],
      [
        "l",
        "o"
      ],
      [
        "d",
        "y"
      ],
      [
        "a",
        "l"
      ],
      [
        "c",
        "k"
      ],
      [
        "o",
        "p"
      ],
      [
        "e",
        "t"
      ],
      [
        "l",
        "ey"
      ],
      [
        "o",
        "r"
      ],
      [
        "C",
        "o"
      ],
      [
        "R",
        "o"
      ],
      [
        "c",
        "e"
      ],
      [
        "u",
        "n"
      ],
      [
        "c",
        "o"
      ],
      [
        "M",
        "i"
      ],
      [
        "R",
        "e"
      ],
      [
        "S",
        "a"
      ],
      [
        "b",
        "y"
      ],
      [
        "c",
        "h"
      ],
      [
        "p",
        "er"
      ],
      [
        "in",
        "n"
      ],
      [
        "ll",
        "y"
      ],
      [
        "as",
        "h"
      ],
      [
        "A",
        "r"
      ]
    ]
  }
}